In [11]:
# Series ( 일차원 데이터로써 정수, 문자, 실수, python object가 될 수 있음)
# 형태 s = pd.Series(data, index=index)

import numpy as np
import pandas as pd 

# From radom.randn 

s = pd.Series(np.random.randn(5), index =["a","b","c","d","e"])
print(s)
print("\n")
print(s.index)

# From dictionary 
print("\n")
d = {"a":0,"b":1,"c":2}
d1 = pd.Series(d)
print(d1)
print("\n")
d2 = pd.Series(d,index = ["a","c","b","d"])
print(d2)

a   -0.145687
b    1.777578
c    0.139604
d   -0.455043
e   -0.357364
dtype: float64


Index(['a', 'b', 'c', 'd', 'e'], dtype='object')


a    0
b    1
c    2
dtype: int64


a    0.0
c    2.0
b    1.0
d    NaN
dtype: float64

In [12]:
# From scalar value
pd.Series(5, index= ["a","b","c","d","e"])

a    5
b    5
c    5
d    5
e    5
dtype: int64

In [22]:
s = pd.Series(np.random.randn(5), index =["a","b","c","d","e"])
print(s+s)
print("\n")
print(s*2)
print("\n")
print(s[1:] + s[:1])

a   -1.054180
b   -1.845598
c    2.172533
d   -0.307201
e   -2.816064
dtype: float64


a   -1.054180
b   -1.845598
c    2.172533
d   -0.307201
e   -2.816064
dtype: float64


a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [23]:
# Name attribute

s = pd.Series(np.random.randn(5), name = "something")
s

0    0.074580
1    0.458529
2   -0.045119
3    0.051177
4    0.809550
Name: something, dtype: float64

In [26]:
# rename a Series with the pandas.Series.rename()

s2 = s.rename("different")
print(s2)
print("\n")
print(s2.name)

0    0.074580
1    0.458529
2   -0.045119
3    0.051177
4    0.809550
Name: different, dtype: float64


different

In [31]:
# DafaFrame (2차원 배열의 데이터)
# From dict of ndarrays / lists

import pandas as pd 
import numpy as np

d= {"one":[1,2,3,4], "two":[5,6,7,8]}
df = pd.DataFrame(d)
print(df)
print("\n")
df2 = pd.DataFrame(d, index = ["a","b","c","d"])  # index 변경하기 
print(df2)

   one  two
0    1    5
1    2    6
2    3    7
3    4    8


   one  two
a    1    5
b    2    6
c    3    7
d    4    8

In [34]:
# From a list of dicts

data = [{"a":1,"b":2},{"a":5,"b":10,"c":20}]

data1 = pd.DataFrame(data)
print(data1)
print("\n")
data2 = pd.DataFrame(data,index = ["first","second"]) # index 변경하기
print(data2)
print("\n")
data3 = pd.DataFrame(data,columns = ["a","b"]) # a, b 컬럼만 갖구오기
print(data3)

   a   b     c
0  1   2   NaN
1  5  10  20.0


        a   b     c
first   1   2   NaN
second  5  10  20.0


   a   b
0  1   2
1  5  10

In [47]:
# Column selection, addition, deletion

df = pd.DataFrame({"one":[1,2,3],"two":[4,5,6],"three":[7,8,9]}, index = ["A","B","C"])
df

   one  two  three
A    1    4      7
B    2    5      8
C    3    6      9

In [48]:
df["one"]

A    1
B    2
C    3
Name: one, dtype: int64

In [49]:
df["multiply"] = df["one"] * df["two"]
df

   one  two  three  multiply
A    1    4      7         4
B    2    5      8        10
C    3    6      9        18

In [50]:
df["boolen"] = df["one"]> 2
df

   one  two  three  multiply  boolen
A    1    4      7         4   False
B    2    5      8        10   False
C    3    6      9        18    True

In [51]:
# deleted or popped

del df["two"]   # del 를 이용해 지우기 
df

   one  three  multiply  boolen
A    1      7         4   False
B    2      8        10   False
C    3      9        18    True

In [52]:
df.pop("three")  # pop을 이용해 지우기 
df

   one  multiply  boolen
A    1         4   False
B    2        10   False
C    3        18    True

In [53]:
df["foo"] = "bar"
df

   one  multiply  boolen  foo
A    1         4   False  bar
B    2        10   False  bar
C    3        18    True  bar

In [54]:
df["one_trunc"] = df["one"][0:1]  # df의 0 index(1행) 까지만 가져온다
df

   one  multiply  boolen  foo  one_trunc
A    1         4   False  bar        1.0
B    2        10   False  bar        NaN
C    3        18    True  bar        NaN

In [55]:
# insert 로 원하는 위치에다 컬럼 추가하기 

df.insert(0,"one_copy",df["one"])
df

   one_copy  one  multiply  boolen  foo  one_trunc
A         1    1         4   False  bar        1.0
B         2    2        10   False  bar        NaN
C         3    3        18    True  bar        NaN